# Задача №7. Списки
# Изучите список:
# my_list = [2, 4, 8].
# Представьте его в обратном порядке двумя способами и
# объясните, в чем между ними разница.

# way 1
print('way 1')
my_list = [2, 4, 8]
print(my_list)
my_list.reverse()
print(my_list)
my_list = [2, 4, 8]

# way 2
print('way 2')
my_list = [2, 4, 8]
print(my_list)
print(my_list[::-1])

